ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <name>ADC0FCLKSEL0</name>
          <description>ADC0 fclk selection 0</description>
          <addressOffset>0x6D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock Output Select 1st Stage. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFRO_CLK</name>
                  <description>SFRO Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALIN_CLK</name>
                  <description>XTALIN Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFRO_CLK</name>
                  <description>FFRO Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC0FCLKSEL1</name>
          <description>ADC0 fclk selection 1</description>
          <addressOffset>0x6D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>ADC Functional Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0FCLKSEL0_MUX_OUT</name>
                  <description>ADC0FCLKSEL0 Multiplexed Output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSPLL0_MAIN_CLK</name>
                  <description>SYSPLL0 MAIN_CLK (PFD0 Output)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSPLL0_AUX0_PLL_Clock</name>
                  <description>SYSPLL0 AUX0_PLL_Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSPLL0_AUX1_PLL_Clock</name>
                  <description>SYSPLL0 AUX1_PLL_Clock.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC0FCLKDIV</name>
          <description>ADC0 fclk divider</description>
          <addressOffset>0x6D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xE00000FF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Selection. . . 0: Divide by 1. ... 255: Divide by 256.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter. The intent is to allow the divider's clock source to be changed without the risk of a glitch at the output.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Divider status flag. Set when a change is made to the divider value, cleared when the change is complete.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTICKFCLKSEL</name>
          <description>UTICK fclk selection</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>uTICK Functional Clock Source Selection. .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT0FCLKSEL</name>
          <description>wdt clock selection</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>WDT0 Functional Clock Source Selection. .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKECLK32KHZSEL</name>
          <description>32k wake clock selection</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>32KHz Wake Clock Low Power Functional Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQ_32KHZ</name>
                  <description>32KHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>LPOSC (Divided by 32 by default).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKECLK32KHZDIV</name>
          <description>32k wake clock divider</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xE00000FF</resetMask>
          <fields>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter. The intent is to allow the divider's clock source to be changed without the risk of a glitch at the output.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTICKFCLKSEL</name>
          <description>system tick fclk selection</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>SYSTICK Functional Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSTICK_DIV_CLK</name>
                  <description>Systick Divider Output Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_32KHZ</name>
                  <description>32KHz RTC Clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFRO_CLK</name>
                  <description>SFRO Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTICKFCLKDIV</name>
          <description>system tick fclk divider</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xE00000FF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Selection. . . 0: Divide by 1. ... 255: Divide by 256.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter. The intent is to allow the divider's clock source to be changed without the risk of a glitch at the output.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Divider status flag. Set when a change is made to the divider value, cleared when the change is complete.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
