ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <name>PSCCTL1_SET</name>
          <description>clock set register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HSGPIO0_CLK_SET</name>
              <description>HSGPIO0 clock set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO1_CLK_SET</name>
              <description>HSGPIO1 clock set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO2_CLK_SET</name>
              <description>HSGPIO2 clock set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO3_CLK_SET</name>
              <description>HSGPIO3 clock set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO4_CLK_SET</name>
              <description>HSGPIO4 clock set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO5_CLK_SET</name>
              <description>HSGPIO5 clock set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO6_CLK_SET</name>
              <description>HSGPIO6 clock set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO7_CLK_SET</name>
              <description>HSGPIO7 clock set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_CLK_SET</name>
              <description>CRC clock set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC0_CLK_SET</name>
              <description>DMAC0 clock set</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC1_CLK_SET</name>
              <description>DMAC1 clock set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU_CLK_SET</name>
              <description>MU clock set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA_CLK_SET</name>
              <description>SEMA clock set</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQME_CLK_SET</name>
              <description>FREQME clock set</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL1 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSCCTL2_SET</name>
          <description>clock set register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CT32BIT0_CLK_SET</name>
              <description>ct32bit timer 0 clock set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT1_CLK_SET</name>
              <description>ct32bit timer 1 clock set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT2_CLK_SET</name>
              <description>ct32bit timer 2 clock set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT3_CLK_SET</name>
              <description>ct32bit timer 3 clock set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT4_CLK_SET</name>
              <description>ct32bit timer 4 clock set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_LITE_CLK_SET</name>
              <description>rtc lite clock set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT0_CLK_SET</name>
              <description>mrt0 clock set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT1_CLK_SET</name>
              <description>wdt1 clock set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C0_CLK_SET</name>
              <description>i3c0 clock set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOINTCTL_CLK_SET</name>
              <description>GPIOINTCTL clock set</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIMCTL_CLK_SET</name>
              <description>PIMCTL clock set</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_CLOCK</name>
                  <description>Sets the PSCCTL2 Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
