ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INPUTMUX</name>
      <description>LPC_Next0 Peripheral Input Multiplexers Controller</description>
      <groupName>INPUTMUX</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7B4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6</dimIndex>
          <name>SCT0_IN_SEL%s</name>
          <description>SCT Peripheral Input Multiplexers N</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>SCT_IN_SEL</name>
              <description>SCT0 Input(n) Selection. 24:1 Selection for each. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCT0_PIN_INP0</name>
                  <description>SCT0_PIN_INP0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP1</name>
                  <description>SCT0_PIN_INP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP2</name>
                  <description>SCT0_PIN_INP2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP3</name>
                  <description>SCT0_PIN_INP3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP4</name>
                  <description>SCT0_PIN_INP4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP5</name>
                  <description>SCT0_PIN_INP5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP6</name>
                  <description>SCT0_PIN_INP6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_PIN_INP7</name>
                  <description>SCT0_PIN_INP7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT0_MAT0</name>
                  <description>CT32BIT0_MAT0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT1_MAT0</name>
                  <description>CT32BIT1_MAT0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT2_MAT0</name>
                  <description>CT32BIT2_MAT0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT3_MAT0</name>
                  <description>CT32BIT3_MAT0</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT4_MAT0</name>
                  <description>CT32BIT4_MAT0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIRQ</name>
                  <description>ADCIRQ</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOINT_BMATCH</name>
                  <description>GPIOINT_BMATCH</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB1_FRAME_TOGGLE</name>
                  <description>USB1_FRAME_TOGGLE</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_OUT</name>
                  <description>CMP0_OUT</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_I2S0_SCLK</name>
                  <description>SHARED I2S0_SCLK</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_I2S1_SCLK</name>
                  <description>SHARED I2S1_SCLK</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_I2S0_WS</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_I2S1_WS</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLK</name>
                  <description>MCLK</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_TXEV</name>
                  <description>ARM_TXEV</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG_HALTED</name>
                  <description>DEBUG_HALTED</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>PINT_SEL%s</name>
          <description>GPIO Pin Input Multiplexer N</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>PINT_SEL</name>
              <description>Port Input (PIOx.y) 64 to 8 Mux Select. . . Pin number select for pin interrupt or pattern match engine input. (For PIOx_y: INTPIN = (x * 32) + y. PIO0_0 to PIO1_31 correspond to numbers 0 to 63.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>27</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DSP_INT_SEL[%s]</name>
          <description>DSP Interrupt Input Multiplexers N</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>DSP_INT_SEL</name>
              <description>DSP Input(n) Selection. 34:1 Selection for each. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ0</name>
                  <description>GPIO_INT0_IRQ0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ1</name>
                  <description>GPIO_INT0_IRQ1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ2</name>
                  <description>GPIO_INT0_IRQ2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ3</name>
                  <description>GPIO_INT0_IRQ3</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ4</name>
                  <description>GPIO_INT0_IRQ4</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ5</name>
                  <description>GPIO_INT0_IRQ5</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ6</name>
                  <description>GPIO_INT0_IRQ6</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ7</name>
                  <description>GPIO_INT0_IRQ7</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSHSGPIO_INT0</name>
                  <description>NSHSGPIO_INT0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSHSGPIO_INT1</name>
                  <description>NSHSGPIO_INT1</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT1</name>
                  <description>WDT1</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0</name>
                  <description>DMAC0</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1</name>
                  <description>DMAC1</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MU</name>
                  <description>MU</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTICK0</name>
                  <description>UTICK0</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MRT0</name>
                  <description>MRT0</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OS_EVENT_TIMER_or_OS_EVENT_WAKEUP</name>
                  <description>OS_EVENT_TIMER or OS_EVENT_WAKEUP</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT0</name>
                  <description>CT32BIT0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT1</name>
                  <description>CT32BIT1</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT2</name>
                  <description>CT32BIT2</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT3</name>
                  <description>CT32BIT3</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT4</name>
                  <description>CT32BIT4</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_LITE0_ALARM_or_RTC_LITE0_WAKEUP</name>
                  <description>RTC_LITE0_ALARM or RTC_LITE0_WAKEUP</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C0</name>
                  <description>I3C0</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMIC0</name>
                  <description>DMIC0</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWVAD0</name>
                  <description>HWVAD0</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI</name>
                  <description>FLEXSPI</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMAC0_ITRIG_SEL[%s]</name>
          <description>DMAC0 Input Trigger Multiplexers N</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>DMA0_ITRIG_SEL</name>
              <description>DMA Input Triggers(n) Selection. 22:1 Selection for each. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT0</name>
                  <description>NSGPIOPINT0_INT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT1</name>
                  <description>NSGPIOPINT0_INT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT2</name>
                  <description>NSGPIOPINT0_INT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT3</name>
                  <description>NSGPIOPINT0_INT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT0_DMAREQ_M0</name>
                  <description>CT32BIT0_DMAREQ_M0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT0_DMAREQ_M1</name>
                  <description>CT32BIT0_DMAREQ_M1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT1_DMAREQ_M0</name>
                  <description>CT32BIT1_DMAREQ_M0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT1_DMAREQ_M1</name>
                  <description>CT32BIT1_DMAREQ_M1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT2_DMAREQ_M0</name>
                  <description>CT32BIT2_DMAREQ_M0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT2_DMAREQ_M1</name>
                  <description>CT32BIT2_DMAREQ_M1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT3_DMAREQ_M0</name>
                  <description>CT32BIT3_DMAREQ_M0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT3_DMAREQ_M1</name>
                  <description>CT32BIT3_DMAREQ_M1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT4_DMAREQ_M0</name>
                  <description>CT32BIT4_DMAREQ_M0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT4_DMAREQ_M1</name>
                  <description>CT32BIT4_DMAREQ_M1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_TRIGOUT_A</name>
                  <description>DMAC0_TRIGOUT_A</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_TRIGOUT_B</name>
                  <description>DMAC0_TRIGOUT_B</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_TRIGOUT_C</name>
                  <description>DMAC0_TRIGOUT_C</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_TRIGOUT_D</name>
                  <description>DMAC0_TRIGOUT_D</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_DMA0</name>
                  <description>SCT0_DMA0</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_DMA1</name>
                  <description>SCT0_DMA1</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASHCRYPT_OUT_DMA</name>
                  <description>HASHCRYPT_OUT_DMA</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_DMA</name>
                  <description>ACMP_DMA</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DMAC</name>
                  <description>ADC_DMAC</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_RX</name>
                  <description>FLEXSPI_RX</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_TX</name>
                  <description>FLEXSPI_TX</description>
                  <value>0x1D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
