ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>DMAC0_OTRIG_SEL%s</name>
          <description>DMAC0 Output Trigger Multiplexers N</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>DMAC0_OTRIG_SEL</name>
              <description>DMAC0 Output Triggers Select for A, B, C, D IE.,DMAC0_OTRIG_A, DMAC0_OTRIG_B, DMAC0_OTRIG_C, DMAC0_OTRIG_D DMA0 Output Triggers(n) Selection. 32:1 Selection for each. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH0</name>
                  <description>DMAC0_OTRIG_CH0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH1</name>
                  <description>DMAC0_OTRIG_CH1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH2</name>
                  <description>DMAC0_OTRIG_CH2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH3</name>
                  <description>DMAC0_OTRIG_CH3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH4</name>
                  <description>DMAC0_OTRIG_CH4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH5</name>
                  <description>DMAC0_OTRIG_CH5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH6</name>
                  <description>DMAC0_OTRIG_CH6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH7</name>
                  <description>DMAC0_OTRIG_CH7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH8</name>
                  <description>DMAC0_OTRIG_CH8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH9</name>
                  <description>DMAC0_OTRIG_CH9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH10</name>
                  <description>DMAC0_OTRIG_CH10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH11</name>
                  <description>DMAC0_OTRIG_CH11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH12</name>
                  <description>DMAC0_OTRIG_CH12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH13</name>
                  <description>DMAC0_OTRIG_CH13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH14</name>
                  <description>DMAC0_OTRIG_CH14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH15</name>
                  <description>DMAC0_OTRIG_CH15</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH16</name>
                  <description>DMAC0_OTRIG_CH16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH17</name>
                  <description>DMAC0_OTRIG_CH17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH18</name>
                  <description>DMAC0_OTRIG_CH18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH19</name>
                  <description>DMAC0_OTRIG_CH19</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH20</name>
                  <description>DMAC0_OTRIG_CH20</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH21</name>
                  <description>DMAC0_OTRIG_CH21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH22</name>
                  <description>DMAC0_OTRIG_CH22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH23</name>
                  <description>DMAC0_OTRIG_CH23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH24</name>
                  <description>DMAC0_OTRIG_CH24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH25</name>
                  <description>DMAC0_OTRIG_CH25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH26</name>
                  <description>DMAC0_OTRIG_CH26</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH27</name>
                  <description>DMAC0_OTRIG_CH27</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH28</name>
                  <description>DMAC0_OTRIG_CH28</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH29</name>
                  <description>DMAC0_OTRIG_CH29</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH30</name>
                  <description>DMAC0_OTRIG_CH30</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH31</name>
                  <description>DMAC0_OTRIG_CH31</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH32</name>
                  <description>DMAC0_OTRIG_CH32</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMAC1_ITRIG_SEL[%s]</name>
          <description>DMAC1 Input Trigger Multiplexers N</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>DMA1_ITRIG_SEL</name>
              <description>DMA Input Triggers(n) Selection. 18:1 Selection for each. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT0</name>
                  <description>NSGPIOPINT0_INT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT1</name>
                  <description>NSGPIOPINT0_INT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT2</name>
                  <description>NSGPIOPINT0_INT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSGPIOPINT0_INT3</name>
                  <description>NSGPIOPINT0_INT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT0_DMAREQ_M0</name>
                  <description>CT32BIT0_DMAREQ_M0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT0_DMAREQ_M1</name>
                  <description>CT32BIT0_DMAREQ_M1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT1_DMAREQ_M0</name>
                  <description>CT32BIT1_DMAREQ_M0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT1_DMAREQ_M1</name>
                  <description>CT32BIT1_DMAREQ_M1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT2_DMAREQ_M0</name>
                  <description>CT32BIT2_DMAREQ_M0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT2_DMAREQ_M1</name>
                  <description>CT32BIT2_DMAREQ_M1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT3_DMAREQ_M0</name>
                  <description>CT32BIT3_DMAREQ_M0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT3_DMAREQ_M1</name>
                  <description>CT32BIT3_DMAREQ_M1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT4_DMAREQ_M0</name>
                  <description>CT32BIT4_DMAREQ_M0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32BIT4_DMAREQ_M1</name>
                  <description>CT32BIT4_DMAREQ_M1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_TRIGOUT_A</name>
                  <description>DMAC1_TRIGOUT_A</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_TRIGOUT_B</name>
                  <description>DMAC1_TRIGOUT_B</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_TRIGOUT_C</name>
                  <description>DMAC1_TRIGOUT_C</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_TRIGOUT_D</name>
                  <description>DMAC0_TRIGOUT_D</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_DMAC0</name>
                  <description>SCT0_DMAC0</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_DMAC1</name>
                  <description>SCT0_DMAC1</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASHCRYPT_OUT_DMA</name>
                  <description>HASHCRYPT_OUT_DMA</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_DMA</name>
                  <description>ACMP_DMA</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DMAC</name>
                  <description>ADC_DMAC</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_RX</name>
                  <description>FLEXSPI_RX</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_TX</name>
                  <description>FLEXSPI_TX</description>
                  <value>0x1D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>DMAC1_OTRIG_SEL%s</name>
          <description>DMAC1 Output Trigger Multiplexers N</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>DMAC1_OTRIG_SEL</name>
              <description>DMA1 Output Triggers Select for A, B, C, D IE., DMA1_OTRIG_A, DMA1_OTRIG_B, DM1_OTRIG_C, DMA1_OTRIG_D DMA0 Output Triggers(n) Selection. 32:1 Selection for each. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH0</name>
                  <description>DMAC1_OTRIG_CH0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH1</name>
                  <description>DMAC1_OTRIG_CH1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH2</name>
                  <description>DMAC1_OTRIG_CH2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH3</name>
                  <description>DMAC1_OTRIG_CH3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH4</name>
                  <description>DMAC1_OTRIG_CH4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH5</name>
                  <description>DMAC1_OTRIG_CH5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH6</name>
                  <description>DMAC1_OTRIG_CH6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH7</name>
                  <description>DMAC1_OTRIG_CH7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH8</name>
                  <description>DMAC1_OTRIG_CH8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH9</name>
                  <description>DMAC1_OTRIG_CH9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH10</name>
                  <description>DMAC1_OTRIG_CH10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH11</name>
                  <description>DMAC1_OTRIG_CH11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH12</name>
                  <description>DMAC1_OTRIG_CH12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH13</name>
                  <description>DMAC1_OTRIG_CH13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH14</name>
                  <description>DMAC1_OTRIG_CH14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH15</name>
                  <description>DMAC1_OTRIG_CH15</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH16</name>
                  <description>DMAC1_OTRIG_CH16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH17</name>
                  <description>DMAC1_OTRIG_CH17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH18</name>
                  <description>DMAC1_OTRIG_CH18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH19</name>
                  <description>DMAC1_OTRIG_CH19</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH20</name>
                  <description>DMAC1_OTRIG_CH20</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH21</name>
                  <description>DMAC1_OTRIG_CH21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH22</name>
                  <description>DMAC1_OTRIG_CH22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH23</name>
                  <description>DMAC1_OTRIG_CH23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH24</name>
                  <description>DMAC1_OTRIG_CH24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH25</name>
                  <description>DMAC1_OTRIG_CH25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH26</name>
                  <description>DMAC1_OTRIG_CH26</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH27</name>
                  <description>DMAC1_OTRIG_CH27</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH28</name>
                  <description>DMAC1_OTRIG_CH28</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH29</name>
                  <description>DMAC1_OTRIG_CH29</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH30</name>
                  <description>DMAC1_OTRIG_CH30</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH31</name>
                  <description>DMAC1_OTRIG_CH31</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_OTRIG_CH32</name>
                  <description>DMAC1_OTRIG_CH32</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
