ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <name>FLSHA1CR0</name>
          <description>Flash Control Register 0</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLSHSZ</name>
              <description>Flash Size in KByte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLSHA2CR0</name>
          <description>Flash Control Register 0</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLSHSZ</name>
              <description>Flash Size in KByte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLSHB1CR0</name>
          <description>Flash Control Register 0</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLSHSZ</name>
              <description>Flash Size in KByte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLSHB2CR0</name>
          <description>Flash Control Register 0</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLSHSZ</name>
              <description>Flash Size in KByte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A1,A2,B1,B2</dimIndex>
          <name>FLSHCR1%s</name>
          <description>Flash Control Register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x63</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCSS</name>
              <description>Serial Flash CS setup time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCSH</name>
              <description>Serial Flash CS Hold time.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WA</name>
              <description>Word Addressable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAS</name>
              <description>Column Address Size.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSINTERVALUNIT</name>
              <description>CS interval unit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSINTERVALUNIT_0</name>
                  <description>The CS interval unit is 1 serial clock cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSINTERVALUNIT_1</name>
                  <description>The CS interval unit is 256 serial clock cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSINTERVAL</name>
              <description>This field is used to set the minimum interval between flash device Chip selection deassertion and flash device Chip selection assertion. If external flash has a limitation on the interval between command sequences, this field should be set accordingly. If there is no limitation, set this field with value 0x0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A1,A2,B1,B2</dimIndex>
          <name>FLSHCR2%s</name>
          <description>Flash Control Register 2</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARDSEQID</name>
              <description>Sequence Index for AHB Read triggered Command in LUT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARDSEQNUM</name>
              <description>Sequence Number for AHB Read triggered Command in LUT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWRSEQID</name>
              <description>Sequence Index for AHB Write triggered Command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWRSEQNUM</name>
              <description>Sequence Number for AHB Write triggered Command.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWRWAIT</name>
              <description>For certain devices (such as FPGA), it need some time to write data into internal memory after the command sequences finished on FlexSPI interface</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWRWAITUNIT</name>
              <description>AWRWAIT unit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AWRWAITUNIT_0</name>
                  <description>The AWRWAIT unit is 2 ahb clock cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_1</name>
                  <description>The AWRWAIT unit is 8 ahb clock cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_2</name>
                  <description>The AWRWAIT unit is 32 ahb clock cycle</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_3</name>
                  <description>The AWRWAIT unit is 128 ahb clock cycle</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_4</name>
                  <description>The AWRWAIT unit is 512 ahb clock cycle</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_5</name>
                  <description>The AWRWAIT unit is 2048 ahb clock cycle</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_6</name>
                  <description>The AWRWAIT unit is 8192 ahb clock cycle</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWRWAITUNIT_7</name>
                  <description>The AWRWAIT unit is 32768 ahb clock cycle</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRINSTRPTR</name>
              <description>Clear the instruction pointer which is internally saved pointer by JMP_ON_CS. Refer Programmable Sequence Engine for details.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLSHCR4</name>
          <description>Flash Control Register 4</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMOPT1</name>
              <description>Write mask option bit 1. This option bit could be used to remove AHB write burst start address alignment limitation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WMOPT1_0</name>
                  <description>DQS pin will be used as Write Mask when writing to external device. There is no limitation on AHB write burst start address alignment when flash is accessed in individual mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WMOPT1_1</name>
                  <description>DQS pin will not be used as Write Mask when writing to external device. There is limitation on AHB write burst start address alignment when flash is accessed in individual mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WMENA</name>
              <description>Write mask enable bit for flash device on port A. When write mask function is needed for memory device on port A, this bit must be set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WMENA_0</name>
                  <description>Write mask is disabled, DQS(RWDS) pin will be un-driven when writing to external device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WMENA_1</name>
                  <description>Write mask is enabled, DQS(RWDS) pin will be driven by FlexSPI as write mask output when writing to external device.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WMENB</name>
              <description>Write mask enable bit for flash device on port B. When write mask function is needed for memory device on port B, this bit must be set.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WMENB_0</name>
                  <description>Write mask is disabled, DQS(RWDS) pin will be un-driven when writing to external device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WMENB_1</name>
                  <description>Write mask is enabled, DQS(RWDS) pin will be driven by FlexSPI as write mask output when writing to external device.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCR0</name>
          <description>IP Control Register 0</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SFAR</name>
              <description>Serial Flash Address for IP command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCR1</name>
          <description>IP Control Register 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDATSZ</name>
              <description>Flash Read/Program Data Size (in Bytes) for IP command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISEQID</name>
              <description>Sequence Index in LUT for IP command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISEQNUM</name>
              <description>Sequence Number for IP command: ISEQNUM+1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPAREN</name>
              <description>Parallel mode Enabled for IP command.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPAREN_0</name>
                  <description>Flash will be accessed in Individual mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPAREN_1</name>
                  <description>Flash will be accessed in Parallel mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCMD</name>
          <description>IP Command Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRG</name>
              <description>Setting this bit will trigger an IP Command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLPR</name>
          <description>Data Learn Pattern Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLP</name>
              <description>Data Learning Pattern.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRXFCR</name>
          <description>IP RX FIFO Control Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRIPRXF</name>
              <description>Clear all valid data entries in IP RX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>IP RX FIFO reading by DMA enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXDMAEN_0</name>
                  <description>IP RX FIFO would be read by processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDMAEN_1</name>
                  <description>IP RX FIFO would be read by DMA.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWMRK</name>
              <description>Watermark level is (RXWMRK+1)*64 Bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTXFCR</name>
          <description>IP TX FIFO Control Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRIPTXF</name>
              <description>Clear all valid data entries in IP TX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>IP TX FIFO filling by DMA enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXDMAEN_0</name>
                  <description>IP TX FIFO would be filled by processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDMAEN_1</name>
                  <description>IP TX FIFO would be filled by DMA.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXWMRK</name>
              <description>Watermark level is (TXWMRK+1)*64 Bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A,B</dimIndex>
          <name>DLLCR%s</name>
          <description>DLL Control Register 0</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLLEN</name>
              <description>DLL calibration enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLRESET</name>
              <description>Software could force a reset on DLL by setting this field to 0x1. This will cause the DLL to lose lock and re-calibrate to detect an ref_clock half period phase shift. The reset action is edge triggered, so software need to clear this bit after set this bit (no delay limitation).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVDLYTARGET</name>
              <description>The delay target for slave delay line is: ((SLVDLYTARGET+1) * 1/32 * clock cycle of reference clock (serial root clock). If serial root clock is &gt;= 100 MHz, DLLEN set to 0x1, OVRDEN set to =0x0, then SLVDLYTARGET setting of 0xF is recommended.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRDEN</name>
              <description>Slave clock delay line delay cell number selection override enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRDVAL</name>
              <description>Slave clock delay line delay cell number selection override value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
