ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTFAD</name>
      <description>OTFAD</description>
      <alternatePeripheral>FLEXSPI</alternatePeripheral>
      <groupName>OTFAD</groupName>
      <baseAddress>0x40134000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xDE0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLDM</name>
              <description>Force Logically Disabled Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLDM_0</name>
                  <description>No effect on the operating mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLDM_1</name>
                  <description>Force entry into LDM after a write with this data bit set. SR[MODE] signals the operating mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRAE</name>
              <description>Restricted Register Access Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RRAE_0</name>
                  <description>Register access is fully enabled. The OTFAD programming model registers can be accessed &quot;normally&quot;.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RRAE_1</name>
                  <description>Register access is restricted and only the CR, SR and optional MDPC registers can be accessed; others are treated as RAZ/WI.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GE</name>
              <description>Global OTFAD Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GE_0</name>
                  <description>OTFAD has decryption disabled. All data fetched by the FLEXSPI bypasses OTFAD processing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GE_1</name>
                  <description>OTFAD has decryption enabled, and processes data fetched by the FLEXSPI as defined by the hardware configuration.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MDPCP</name>
              <description>MDPC Present</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>Operating in Normal mode (NRM)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>Unused (reserved)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_2</name>
                  <description>Unused (reserved)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_3</name>
                  <description>Operating in Logically Disabled Mode (LDM)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCTX</name>
              <description>Number of Contexts</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HRL</name>
              <description>Hardware Revision Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRAM</name>
              <description>Restricted Register Access Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RRAM_0</name>
                  <description>Register access is fully enabled. The OTFAD programming model registers can be accessed &quot;normally&quot;.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RRAM_1</name>
                  <description>Register access is restricted and only the CR, SR and optional MDPC registers can be accessed; others are treated as RAZ/WI.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GEM</name>
              <description>Global Enable Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GEM_0</name>
                  <description>OTFAD is disabled. All data fetched by the FLEXSPI bypasses OTFAD processing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEM_1</name>
                  <description>OTFAD is enabled, and processes data fetched by the FLEXSPI as defined by the hardware configuration.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>CTX[%s]</name>
          <description>no description available</description>
          <addressOffset>0xD00</addressOffset>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>CTX_KEY%s</name>
            <description>AES Key Word</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>AES Key</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1</dimIndex>
            <name>CTX_CTR%s</name>
            <description>AES Counter Word</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CTR</name>
                <description>AES Counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTX_RGD_W0</name>
            <description>AES Region Descriptor Word0</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SRTADDR</name>
                <description>Start Address</description>
                <bitOffset>10</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTX_RGD_W1</name>
            <description>AES Region Descriptor Word1</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3F8</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VLD</name>
                <description>Valid</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VLD_0</name>
                    <description>Context is invalid.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VLD_1</name>
                    <description>Context is valid.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADE</name>
                <description>AES Decryption Enable.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ADE_0</name>
                    <description>Bypass the fetched data.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADE_1</name>
                    <description>Perform the CTR-AES128 mode decryption on the fetched data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RO</name>
                <description>Read-Only</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RO_0</name>
                    <description>The context registers can be accessed normally (as defined by SR[RRAM]).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RO_1</name>
                    <description>The context registers are read-only and accesses may be further restricted based on SR[RRAM].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENDADDR</name>
                <description>End Address</description>
                <bitOffset>10</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
