ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <name>FORCE_EVENT</name>
          <description>Force Event</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEVTAC12NE</name>
              <description>Force Event Auto Command 12 Not Executed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12TOE</name>
              <description>Force Event Auto Command 12 Time Out Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12CE</name>
              <description>Force Event Auto Command 12 CRC Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12EBE</name>
              <description>Force Event Auto Command 12 End Bit Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12IE</name>
              <description>Force Event Auto Command 12 Index Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCNIBAC12E</name>
              <description>Force Event Command Not Executed By Auto Command 12 Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCTOE</name>
              <description>Force Event Command Time Out Error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCCE</name>
              <description>Force Event Command CRC Error</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCEBE</name>
              <description>Force Event Command End Bit Error</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCIE</name>
              <description>Force Event Command Index Error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDTOE</name>
              <description>Force Event Data Time Out Error</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDCE</name>
              <description>Force Event Data CRC Error</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDEBE</name>
              <description>Force Event Data End Bit Error</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12E</name>
              <description>Force Event Auto Command 12 Error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTTNE</name>
              <description>Force Tuning Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDMAE</name>
              <description>Force Event DMA Error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCINT</name>
              <description>Force Event Card Interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_ERR_STATUS</name>
          <description>ADMA Error Status Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADMAES</name>
              <description>ADMA Error State (when ADMA Error is occurred)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADMALME</name>
              <description>ADMA Length Mismatch Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMALME_0</name>
                  <description>No Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMALME_1</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMADCE</name>
              <description>ADMA Descriptor Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMADCE_0</name>
                  <description>No Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMADCE_1</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_SYS_ADDR</name>
          <description>ADMA System Address</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADS_ADDR</name>
              <description>ADMA System Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_CTRL</name>
          <description>DLL (Delay Line) Control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLL_CTRL_ENABLE</name>
              <description>DLL_CTRL_ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_RESET</name>
              <description>DLL_CTRL_RESET</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_FORCE_UPD</name>
              <description>DLL_CTRL_SLV_FORCE_UPD</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_DLY_TARGET0</name>
              <description>DLL_CTRL_SLV_DLY_TARGET0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_GATE_UPDATE</name>
              <description>DLL_CTRL_GATE_UPDATE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_OVERRIDE</name>
              <description>DLL_CTRL_SLV_OVERRIDE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_OVERRIDE_VAL</name>
              <description>DLL_CTRL_SLV_OVERRIDE_VAL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_DLY_TARGET1</name>
              <description>DLL_CTRL_SLV_DLY_TARGET1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_UPDATE_INT</name>
              <description>DLL_CTRL_SLV_UPDATE_INT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_REF_UPDATE_INT</name>
              <description>DLL_CTRL_REF_UPDATE_INT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_STATUS</name>
          <description>DLL Status</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLL_STS_SLV_LOCK</name>
              <description>DLL_STS_SLV_LOCK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_REF_LOCK</name>
              <description>DLL_STS_REF_LOCK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_SLV_SEL</name>
              <description>DLL_STS_SLV_SEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_REF_SEL</name>
              <description>DLL_STS_REF_SEL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_TUNE_CTRL_STATUS</name>
          <description>CLK Tuning Control and Status</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY_CELL_SET_POST</name>
              <description>DLY_CELL_SET_POST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_CELL_SET_OUT</name>
              <description>DLY_CELL_SET_OUT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_CELL_SET_PRE</name>
              <description>DLY_CELL_SET_PRE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NXT_ERR</name>
              <description>NXT_ERR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_POST</name>
              <description>TAP_SEL_POST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_OUT</name>
              <description>TAP_SEL_OUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_PRE</name>
              <description>TAP_SEL_PRE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRE_ERR</name>
              <description>PRE_ERR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STROBE_DLL_CTRL</name>
          <description>Strobe DLL Control</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STROBE_DLL_CTRL_ENABLE</name>
              <description>Strobe DLL Control Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_RESET</name>
              <description>Strobe DLL Control Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_FORCE_UPD</name>
              <description>Strobe DLL Control Slave Force Updated</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_DLY_TARGET</name>
              <description>Strobe DLL Control Slave Delay Target</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_GATE_UPDATE_0</name>
              <description>Strobe DLL Control Gate Update</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_GATE_UPDATE_1</name>
              <description>Strobe DLL Control Gate Update</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_OVERRIDE</name>
              <description>Strobe DLL Control Slave Override</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_OVERRIDE_VAL</name>
              <description>Strobe DLL Control Slave Override Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_UPDATE_INT</name>
              <description>Strobe DLL Control Slave Update Interval</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_REF_UPDATE_INT</name>
              <description>Strobe DLL Control Reference Update Interval</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STROBE_DLL_STATUS</name>
          <description>Strobe DLL Status</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STROBE_DLL_STS_SLV_LOCK</name>
              <description>Strobe DLL Status Slave Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STROBE_DLL_STS_REF_LOCK</name>
              <description>Strobe DLL Status Reference Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STROBE_DLL_STS_SLV_SEL</name>
              <description>Strobe DLL Status Slave Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STROBE_DLL_STS_REF_SEL</name>
              <description>Strobe DLL Status Reference Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VEND_SPEC</name>
          <description>Vendor Specific Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20007809</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSELECT</name>
              <description>Voltage selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSELECT_0</name>
                  <description>Change the voltage to high voltage range, around 3.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSELECT_1</name>
                  <description>Change the voltage to low voltage range, around 1.8 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12_WR_CHKBUSY_EN</name>
              <description>Check busy enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12_WR_CHKBUSY_EN_0</name>
                  <description>Do not check busy after auto CMD12 for write data packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12_WR_CHKBUSY_EN_1</name>
                  <description>Check busy after auto CMD12 for write data packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRC_SDCLK_ON</name>
              <description>Force CLK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRC_SDCLK_ON_0</name>
                  <description>CLK active or inactive is fully controlled by the hardware.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC_SDCLK_ON_1</name>
                  <description>Force CLK active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_CHK_DIS</name>
              <description>CRC Check Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CHK_DIS_0</name>
                  <description>Check CRC16 for every read data packet and check CRC bits for every write data packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CHK_DIS_1</name>
                  <description>Ignore CRC16 check for every read data packet and ignore CRC bits check for every write data packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD_BYTE_EN</name>
              <description>Byte access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_BYTE_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_BYTE_EN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
