ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <name>SWTRIG</name>
          <description>Software Trigger Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWT0</name>
              <description>Software trigger 0 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT0_0</name>
                  <description>No trigger 0 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT0_1</name>
                  <description>Trigger 0 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT1</name>
              <description>Software trigger 1 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT1_0</name>
                  <description>No trigger 1 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT1_1</name>
                  <description>Trigger 1 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT2</name>
              <description>Software trigger 2 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT2_0</name>
                  <description>No trigger 2 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT2_1</name>
                  <description>Trigger 2 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT3</name>
              <description>Software trigger 3 event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT3_0</name>
                  <description>No trigger 3 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT3_1</name>
                  <description>Trigger 3 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT4</name>
              <description>Software trigger 4 event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT4_0</name>
                  <description>No trigger 4 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT4_1</name>
                  <description>Trigger 4 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT5</name>
              <description>Software trigger 5 event</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT5_0</name>
                  <description>No trigger 5 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT5_1</name>
                  <description>Trigger 5 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT6</name>
              <description>Software trigger 6 event</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT6_0</name>
                  <description>No trigger 6 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT6_1</name>
                  <description>Trigger 6 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT7</name>
              <description>Software trigger 7 event</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT7_0</name>
                  <description>No trigger 7 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT7_1</name>
                  <description>Trigger 7 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT8</name>
              <description>Software trigger 8 event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT8_0</name>
                  <description>No trigger 8 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT8_1</name>
                  <description>Trigger 8 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT9</name>
              <description>Software trigger 9 event</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT9_0</name>
                  <description>No trigger 9 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT9_1</name>
                  <description>Trigger 9 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT10</name>
              <description>Software trigger 10 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT10_0</name>
                  <description>No trigger 10 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT10_1</name>
                  <description>Trigger 10 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT11</name>
              <description>Software trigger 11 event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT11_0</name>
                  <description>No trigger 11 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT11_1</name>
                  <description>Trigger 11 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT12</name>
              <description>Software trigger 12 event</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT12_0</name>
                  <description>No trigger 12 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT12_1</name>
                  <description>Trigger 12 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT13</name>
              <description>Software trigger 13 event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT13_0</name>
                  <description>No trigger 13 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT13_1</name>
                  <description>Trigger 13 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT14</name>
              <description>Software trigger 14 event</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT14_0</name>
                  <description>No trigger 14 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT14_1</name>
                  <description>Trigger 14 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT15</name>
              <description>Software trigger 15 event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT15_0</name>
                  <description>No trigger 15 event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT15_1</name>
                  <description>Trigger 15 event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TCTRL[%s]</name>
          <description>Trigger Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HTEN</name>
              <description>Trigger enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HTEN_0</name>
                  <description>Hardware trigger source disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HTEN_1</name>
                  <description>Hardware trigger source enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPRI</name>
              <description>Trigger priority setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TPRI_0</name>
                  <description>Set to highest priority, Level 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_1</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_2</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_3</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_4</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_5</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_6</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_7</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_8</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_9</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_15</name>
                  <description>Set to lowest priority, Level 16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDLY</name>
              <description>Trigger delay select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCMD</name>
              <description>Trigger command select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCMD_0</name>
                  <description>Not a valid selection from the command buffer. Trigger event is ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_1</name>
                  <description>CMD1 is executed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_2</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_3</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_4</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_5</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_6</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_7</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_8</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_9</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_15</name>
                  <description>CMD15 is executed</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
