ehughes/rt_super_z/bringup/mk76/mk76__fsb_test/MIMXRT685S_cm33.svd
        <register>
          <name>SEC_MASK_LOCK</name>
          <description>sec_gp_reg write-lock bits</description>
          <addressOffset>0xFBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2AAAA</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>SEC_GPIO_MASK0_LOCK</name>
              <description>SEC_GPIO_MASK0 register write-lock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK1_LOCK</name>
              <description>SEC_GPIO_MASK1 register write-lock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK2_LOCK</name>
              <description>SEC_GPIO_MASK2 register write-lock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK3_LOCK</name>
              <description>SEC_GPIO_MASK3 register write-lock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK4_LOCK</name>
              <description>SEC_GPIO_MASK4 register write-lock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK5_LOCK</name>
              <description>SEC_GPIO_MASK5 register write-lock.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK6_LOCK</name>
              <description>SEC_GPIO_MASK6 register write-lock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK7_LOCK</name>
              <description>SEC_GPIO_MASK7 register write-lock.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_DSP_INT_LOCK</name>
              <description>SEC_DSP_INT_MASK register write-lock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_LEVEL</name>
          <description>master secure level register</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POWERQUAD_SEC</name>
              <description>POWERQUAD master secure level control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP_SEC</name>
              <description>DSP master secure level control.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA0_SEC</name>
              <description>DMA0 master secure level control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1_SEC</name>
              <description>DMA1 master secure level control.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO0_SEC</name>
              <description>SDIO0 master secure level control.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO1_SEC</name>
              <description>SDIO1 master secure level control.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER_SEC_LEVEL_LOCK</name>
              <description>MASTER_SEC_LEVEL register write-lock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restrictive mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
